app/controllers/activities_controller.rb

SELECT * FROM "activities"
---
  def index
    @tag_types = TagType.find(:all)

    @active_selected = params[:active][:active].intern if params[:active]
    @active_selected ||= :active

    @default_selected = params[:default][:default].intern if params[:default]
    @default_selected ||= :all

    if params[:tag] && params[:tag][:id] != "" && params[:tag_type][:id] != "" then
      @tag = Tag.find_by_id(params[:tag][:id])
      @tag_type = @tag.tag_type
      @activities = filter_activity(@tag.activities, @active_selected, @default_selected).paginate(PAGINATION_OPTIONS)