app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "updated_at", "notes", "created_at") VALUES('foo bar', '2009-06-05 06:15:45', NULL, '2009-06-05 06:15:45')
---
  def create
    @category = Category.new(params[:category])
    if @category.save

SELECT * FROM "categories" WHERE ("categories"."id" = 179023376)
SELECT * FROM "activities" WHERE ("activities".category_id = 179023375)
SELECT count(*) AS count_all FROM "activities" WHERE ("activities".category_id = 179023401)
DELETE FROM "categories" WHERE "id" = 179023376
---
  def destroy
    @category = Category.find(params[:id])
    if not @category.activities.empty?
      flash[:error] = "Category cannot be removed because it has associated activities"
      redirect_to :categories
    else
      @category.destroy