app/controllers/time_entries_controller.rb

  def create
    @time_entry = @user.time_entries.build(params[:time_entry])
    if params[:tags].respond_to? :each
      params[:tags].each { |id, value| @time_entry.tags << Tag.find(id.to_i) if value == 'true'}
---
INSERT INTO "time_entries" ("updated_at", "date", "activity_id", "notes", "billed", "hours", "person_id", "locked", "counterpost", "created_at") VALUES('2009-06-06 10:49:38', '2009-06-01', NULL, '', NULL, NULL, NULL, NULL, NULL, '2009-06-06 10:49:38')