app/controllers/week_entries_controller.rb

SELECT * FROM "activities" WHERE ("activities"."id" = '576433300') LIMIT 1
INSERT INTO "time_entries" ("updated_at", "date", "notes", "billed", "hours", "week_entry_id", "locked", "counterpost", "created_at") VALUES('2009-06-07 13:06:48', '2009-06-01', '', NULL, 4.0, 1, NULL, NULL, '2009-06-07 13:06:48')
---
  def create
    @week_entry = WeekEntry.new(params[:week_entry])
    activity = Activity.find_by_id(params[:activity][:id])
    @week_entry.activity = activity
    @week_entry.user_id = current_user_session.user.object_id
    if @week_entry.save

SELECT * FROM "time_entries" WHERE ("time_entries".week_entry_id = 6)
---
  def edit
    @week_entry = WeekEntry.find(params[:id])

SELECT * FROM "time_entries" WHERE ("time_entries".week_entry_id = 6)
UPDATE "time_entries" SET "updated_at" = '2009-06-07 14:06:25', "hours" = 7.5 WHERE "id" = 37
---
  def update
    @week_entry = WeekEntry.find(params[:id])
    if (@week_entry.update_attributes(params[:week_entry]))

SELECT * FROM "time_entries" WHERE ("time_entries".week_entry_id = 9)
DELETE FROM "week_entries" WHERE "id" = 6
---
  def destroy
    @week_entry = WeekEntry.find(params[:id])
    @date = @week_entry.time_entries.sort[0].date
    @week_entry.destroy